{
    "lang" :"Language",
    "Home": "Home",
    "Projects": "Projcets",
    "About_me": "About me",
    "Contanct": "Contact",
    "Hello": "Hello. My name is Paweł!",
    "I_m": "I'm UX/UI Designer & Graphic ",
    "Contact_me": "Contact me",

    "h2_title": "My Projects",
    "p2_text": "My attention was always drawn to the digital interface, the way the website/application was designed. Does it contain the necessary information for the user, is it easy to use and is it readable. I believe that a good project should be created to reach the largest possible base of diverse users. Below are some examples of projects I did + the current page written from scratch in react.",


    "h3_title": "About Me",
    "p3_text": "My name is Pawel and I am a self taught UX/UI designer. I have a degree in IT and Computer science but for several years I worked in state institutions as an office worker. My first passions, however, were always design and digital art. I have completed courses in the use of digital programs (Illustrator, Photoshop), participated in a bootcamp with Web development and most importantly I have completed a course in Ux / Ui design. I spent time working on independent projects to broaden my skills. The UX/UI is a field that combines the creativity of design and the ingenuity of coding to create products that are delightful for users to interact with.",

    "h4_skills": "Skills",

    "h5_free": "What about free time?",
    "p_free": "I try to spend my free time outdoors. Riding a bike, motorbike or walking in the woods are my favorite activities. However, when the weather is bad or it is late in the evening, I play games (mainly mmo) and as a hobby I create graphics using photoshop.",

    "get_in": "Get in Touch",
    "social": "Fallow me on social media",

    "name": "name",
    "Message": "Message",

    "Accept": "Thanks, I'll be in touch shortly.",
    "Sorry": "Sorry, there was a problem. Please try again.",

    "Model-Goals": "Model of goals",
    "Modal-UserFlow": "User Flow",

    "FApp-p1": "Concept of a mobile application that allows you to buy pills online and deliver them to your home.",
    "FApp-Assum": "Assumption",
    "FApp-Assum-p": "Being a fairly frequent customer of a local pharmacy, I started to wonder what if the pharmacy had its own application? Sick people who cannot leave the house for reasons beyond their control, could order medication with delivery. Moreover, the pharmacy customers could search for and choose the products of their interest from the position of the application, which would shorten the time of standing in the queue, which results in saved time.",
    "FApp-Goal": "Goal",
    "FApp-Goal-p": "Designing a pharmacy application with the option of purchasing pills, home delivery / pick at a pharmacy, and quick implementation of prescriptions issued to us.",
    "FApp-Role": "Role",
    "FApp-Role-p": "UX/UI Designer",
    "FApp-Users": "Users",
    "FApp-Users-p": "People of different age categories will use the application. From young to the elderly.",
    "FApp-Model-Goals-p1": "application must be simple and legible",
    "FApp-Model-Goals-p2": "application should contain suggestions of pills substitutes",
    "FApp-Model-Goals-p3": "pplication should contain different payment methods",
    "FApp-Model-Goals-p4": "detailed product description",
    "FApp-UserFlow-p": "Based on the above goals, I started by creating a simple user flow from setting up an account and carrying out in-app purchases. Everything was supposed to be intuitive and legible.",
    "FApp-Sketches": "sketches",
    "FApp-Sketeches-p": "According to what I was taught, my design started with sketching. I put all the ideas that came to my mind on paper and from among them I chose a few drawings that I decided to use in the next stages.",
    "FApp-Wireframes": "Wireframes",
    "FApp-Wireframes-p": "At the beginning of this stage I am only starting to choose the colors, fonts and elements that I will use to create the design. As the target user will be people of different age groups, the application must be easy to use, clear and contain only the necessary information. The basic color I used here is orange, because by standards it is a color that symbolizes health. I started my work with creating simple wireframes based on my sketches. Being satisfied with their appearance I started creating the finished product.",
    "FApp-Wireframes-p2": "After creating all the basic wireframes I started designing the final product. I divided the work into segments to focus only on a given function. Throughout the entire design process I tried to create a product that I would be happy with, which is why I applied corrections all the time.",
    "FApp-Wireframes-p3": "I created several separate prototypes based on individual actions (purchase, creating an account, adding products to the basket, paying, etc.), so that at a later stage the programmers would have an easier task.",
    "FApp-Prototypes-test": "Feel free to check my prototypes.",
    "FApp-Summary": "Summary",
    "FApp-Summary-p": "Pocket Appteka is the first application that I designed. As I mentioned at the beginning, the problems described are understandable to me, so creating it gave me a lot of joy. More and more people take care of all matters, shopping via the Internet, so I think that such an application could work. The biggest problem with this app is prescription fulfillment. The application would have to be compatible with the nfz database, so the implementation of the assumed goal would be complicated. Storing sensitive personal data would have to be additionally secured against possible theft.",
    "FApp-Button1": "First Run",
    "FApp-Button2": "Account Log In and Register",
    "FApp-Button3": "User Panel",
    "FApp-Button4": "Product display from Home",
    "FApp-Button5":"Product display from Category",
    "FApp-Button6":"Search",
    "FApp-Button7":"Prescription",
    "FApp-Button8":"Cart and payment",


    "RnL-p1" : "Concept of a mobile application containing a collection of books in a readable form and an audiobook",
    "RnL-Assum": "Assumption",
    "RnL-Assum-p": "As a lover of paper literature, unfortunately I have to admit that we live in times where it is easier and more pleasant to reach for a reader / tablet than for a book. Such a device is easier to transport, is much lighter and can store many titles. Watching family and friends who read a lot of books in the form of e-books and listen to audiobooks, they use many devices or applications. I came up with the idea of creating a place where both of these functions would be available. We do not always have the option of additionally packing the reader or tablet. In this case, even a telephone would suffice to be able to read / listen to a piece of our favorite book.",
    "RnL-Goal": "Goal",
    "RnL-Goal-p": "Designing an application for the user that will be able to choose his favorite book in an easy and pleasant way and decide whether he wants to read / listen to it.",
    "RnL-Role": "Role",
    "RnL-Role-p": "UX/UI Designer",
    "RnL-Users": "Users",
    "RnL-Users-p": "Based on interviews with my friends and family, I created common goals",
    "RnL-Users-p1": "the ability to search for the book you are interested and add it to your library",
    "RnL-Users-p2": "the ability to easily choose between reading and listening to literature",
    "RnL-Sketches": "Sketches",
    "RnL-UserFlow-p": "Based on my goals, I decided to start by creating simple graphic user flows with short descriptions.",
    "RnL-Sketches-p": "I started the whole design from sketching. I poured ideas onto paper so that the created project was intuitive. So that the user can quickly and easily operate the application. The inspiration was programs for playing music or reading text.",
    "RnL-Wireframes": "Wireframes",
    "RnL-Wireframes-p": "Before I started creating the right wireframes, I decided to choose the right font, colors and prepare elements (such as buttons, icons, frames) to enable more efficient work. After completing everything, I started creating the base wireframes, giving them a light graphical character, showing the basic elements of the application.",    
    "RnL-Wireframes-p1": "User flow and wireframes were created with Figma. I wanted the appearance to be clear and minimalist so that the user could quickly find what he was looking for. It was supposed to resemble a bookshelf, so the background is dark with an imitation of lamp light. The main idea is to find the book that suits to user. He can sort the literature using the category panel or use the search option, then read description and add it to library. The library contains two styles: the first is based on minimalism, modernity and quick selection, while the second has a classic style that can be sorted by category or name.",
    "RnL-Prototypes-test": "Feel free to check my prototypes.",
    "RnL-Summary": "Summary",
    "RnL-Summary-p": "The biggest problem in creating such an application would be to create such a large database with both reading and listening options. Not every book is auditioning, so I used the subscription model. I would consider the option of zooming in on the text read by the user, as not everyone has a device with a large display. The second option is the ability to jump to a page selected by the user while reading.",

    "Hyjal-p": "I started this project purely spontaneously. It was of an entertaining and scientific character. The website that I was going to design was supposed to be about the subject I love. As a supporter of communing with nature, I decided to create a design for a camping site.",
    "Hyjal-p2": "The idea was to use the popular Parallax technique, which is used in designing similar websites.",
    "Hyjal-p3": "It is a One Page website, which is a great solution for fast and effective promotion on the Internet. It contains four basic sections: Home, About, Attractions, and Contact. Each of them has animations that are not tiring for the eye, and add modernity to it.",
    "Hyjal-p4": "As it is an entertainment project, it contains numerous easter eggs from the popular MMO game. Do you know which one?",
    "Hyjal-click": "In order to see its full capabilities, after starting prototype, I encourage you to select the „Fit to screen” option and after it is fully loaded to reset it with the „R” key on the keyboard.",
    "Hyjal-Prototypes-test": "Feel free to check prototype."
    
}