{  
    "lang" :"Język",
    "Home": "Strona Główna",
    "Projects": "Projekty",
    "About_me": "O mnie",
    "Contanct": "Kontakt",

    "Hello" :"Cześć. Jestem Paweł!",
    "I_m" :"Jestem UX/UI Designerem & Grafikiem",
    "Contact_me": "Skontaktuj się ze mną",

    "h2_title": "Moje projekty",
    "p2_text": "Moją uwagę zawsze przyciągał interfejs cyfrowy, sposób w jaki strona internetowa/aplikacja została zaprojektowana. Czy zawiera ona potrzebne informacje dla użytkownika, jest prosta w obsłudze oraz, czy jest czytelna. Uważam, że dobry projekt powinien być stworzony tak by trafił do jak największej bazy zróżnicowanych użytkowników. Poniżej znajdują się przykładowe projekty, które zrobiłem + aktualna strona napisana od zera w reacie.",

    "h3_title": "Parę słów o mnie",
    "p3_text": "Mam na imię Paweł. Ukończyłem szkołę techniczną o profilu informatycznym i uzyskałem dyplom technika informatyka. Przez większość czasu pracowałem w instytucjach państwowych, jednak moją pierwszą pasją było projektowanie i sztuka cyfrowa. Zacząłem więc poszerzać swoje umiejętności pracując nad niezależnymi projektami oraz kończąc szereg kursów z sztuki cyfrowej, obsługi programów cyfrowych, tworzenia stron internetowych no i najważniejsze UX/UI Design. Można powiedzieć, że jestem samoukiem :)",

    "h4_skills": "Umiejętności",

    "h5_free":"A co w wolnym czasie?",
    "p_free": "Wolny czas staram się spędzać na świeżym powietrzu. Jazda na rowerze, motocyklu, czy spacer po lesie są moimi ulubionymi czynnościami. Jednakże, gdy pogoda nie dopisuje lub jest późny wieczór gram w gry (głównie mmo) oraz hobbistycznie tworzę grafiki przy pomocy fotomontażu. ",

    "get_in": "Pozostańmy w kontakcie",
    "social": "Sprawdź moje social media",

    "name": "Imię",
    "Message": "Wiadomość",

    "Accept": "Dziękuję. Za niedługo skontaktuję się z Tobą",
    "Sorry": "Przepraszam. Wystąpił problem. Proszę spróbuj za chwilę ponownie.",

    "Model-Goals": "Model celów",
    "Modal-UserFlow": "User Flow",

    "FApp-p1": "Koncept mobilej aplikacji pozwalającej na zakup leków online i dostarczenie ich do domu.",
    "FApp-Assum": "Założenie",
    "FApp-Assum-p": "Będąc w miarę częstym klientem osiedlowej apteki, zacząłem się zastanawiać, a co gdyby apteka posiadała swoją własną aplikację? Osoby chore, które z przyczyn niezależynch nie mogą opuścić domu, mogłyby zamówić leki z dowozem. Ponadto, klienci apteki z pozycji aplikacji mogliby wyszukać i wybrać interesujące ich produtky, co skróciłoby czas stania w kolejce, co skutkuje zaoszczędzonym czasem.",
    "FApp-Goal": "Cel",
    "FApp-Goal-p": "Zaprojektowanie aplikacji aptecznej z możliwością zakupów leków, dostawy ich do domu/odbioru w aptece oraz szybka realizacja wystawionych dla nas recept.",
    "FApp-Role": "Rola",
    "FApp-Role-p": "UX/UI Designer",
    "FApp-Users": "Użytkownicy",
    "FApp-Users-p": "Z aplikacji będą korzystać ludzie z różnej kategorii wiekowej. Od osób młodych po osoby starsze.",
    "FApp-Model-Goals-p1": "aplikacja musi być prosta i czytelna",
    "FApp-Model-Goals-p2": "aplikacja powinna zawierać propozycje zamienników leków",
    "FApp-Model-Goals-p3": "aplikacja powinna zawierać różne metody płatności",
    "FApp-Model-Goals-p4": "dokładny opis produktu",
    "FApp-UserFlow-p": "Na podstawie powyższych celów, zacząłem od stworzenia prostych user flow z założenia konta oraz przeprowadzenia zakupów w aplikacji. Wszystko miało być intuicyjne i czytelne.",
    "FApp-Sketches": "Szkice",
    "FApp-Sketeches-p": "Zgodnie z tym czego się nauczyłem, design zacząłem od szkicowania. Wszystkie pomysły, które przychodziły mi do głowy przelałem na papier i spośród nich wybrałem kilka rysunków, które postanowiłem wykorzystać w kolejnych etapach.",
    "FApp-Wireframes": "Wireframes",
    "FApp-Wireframes-p": "Na początku tego etapu dopiero przystępuję do wyboru kolorów, czcionki oraz elementów, których użyję przy tworzeniu designu. Jako, że docelowym użytkownikiem będą ludzie w różnym przedziale wiekowym, aplikacja musi być prosta w obsłudze, przejrzysta oraz zawierająca tylko potrzebne informacje. Kolorem podstawowym jaki tutaj zastosowałem to pomarańczowy, gdyż według standardów jest to kolor symbolizujący zdrowie. Pracę zacząłem od stworzenia prostych wireframes opartych na moich szkicach. Będąc zadowolony z ich wyglądu przystąpiłem do tworzenia gotowego produktu.",
    "FApp-Wireframes-p2": "Po utworzeniu wszystkich bazowych wireframes, przystąpiłem do zaprojektowania finalnego produktu. Pracę podzieliłem na segmenty, by skupić się tylko na danej funkcji. Przez całe projektowanie, dążyłem do stworzenia aplikacji z któej będę zadowolony, dlatego też cały czas nanosiłem poprawki.",
    "FApp-Wireframes-p3": "Stworzyłem kilka osobnych prototypów opierających się na poszczególnych akcjach (zakup, założenie konta, dodanie produktów do koszyka, opłacenie itd.), tak by w późniejszym etapie programiści mieli ułatwione zadanie.",
    "FApp-Prototypes-test": "Zapraszam do przetestowania moich prototypów.",
    "FApp-Summary": "Podsumowanie",
    "FApp-Summary-p": "Kieszonkowa Appteka jest pierwszą aplikacją zaprojektowaną przeze mnie. Jak wspomniałem na początku problemy są dla mnie zrozumiane, dlatego tworzenie jej sprawiło mi dużo radości. Coraz więcej osób dokonuje zakupów przez internet, dlatego uważam, iż taka aplikacja może spełnić swoje zadanie. Największym problemem występującym w tej aplikacji jest realizacja recept. Aplikacja musiałaby współgrać z bazą danych nfz, więc realizacja założonego celu byłaby skomplikowana. Przechowywanie wrażliwych danych osobowych musiałoby być dodatkowo zabezpieczone przed ewentualną kradzieżą.",
    "FApp-Button1": "Pierwsze uruchomienie",
    "FApp-Button2": "Zalogowanie i rejestracja",
    "FApp-Button3": "Panel użytkownika",
    "FApp-Button4": "Produkt z ekranu głównego",
    "FApp-Button5":"Produkt z menu kategorii",
    "FApp-Button6":"Szukaj",
    "FApp-Button7":"Recepta",
    "FApp-Button8":"Koszyk i płatność",

    "RnL-p1" : "Koncept mobilej aplikacji zawierającej kolekcję książek w postaci czytelnej i audiobooka",
    "RnL-Assum": "Założenie",
    "RnL-Assum-p": "Jako zwolennik literatury papierowej niestety muszę przyznać, iż żyjemy w czasach gdzie łatwiej i przyjemniej sięgnąć nam po czytnik/tablet, niż po książkę. Urządzenie takie łatwiej transportować, jest dużo lżejsze oraz może przechowywać wiele tytułów. Obserwując rodzinę oraz znajomych, którzy czytają dużo książek w postaci ebooków oraz słuchają audiobooków korzystają z wielu urządzeń, czy też aplikacji wpadłem na pomysł stworzenia miejsca, gdzie obie te funkcje byłyby dostępne. Nie zawsze mamy możliwość dodatkowego zabrania ze sobą czytnika czy tabletu. W tym wypadku wystarczyłby nam nawet telefon, by móc przeczytać lub posłuchać kawałku naszej ulubionej książki.",
    "RnL-Goal": "Cel",
    "RnL-Goal-p": "Zaprojektowanie aplikacji, dzięki której w łatwy i przyjemny sposób użytkownik będzie mógł wybrać swoją ulubioną książkę i zdecydować, czy chce ją przeczytać lub posłuchać.",
    "RnL-Role": "Rola",
    "RnL-Role-p": "UX/UI Designer",
    "RnL-Users": "Użytkownicy",
    "RnL-Users-p": "W oparciu o wywiady przeprowadzonych z moimi znajomymi oraz rodziną, stworzyłem wspólne cele:",
    "RnL-Users-p1": "możliwość wyszukiwania interesującej nas książki oraz dodania jej do swojej biblioteki",
    "RnL-Users-p2": "możliwość łatwego wyboru między czytaniem a słuchaniem literatury",
    "RnL-Sketches": "Szkice",
    "RnL-UserFlow-p": "Na podstawie założonych celów, postanowiłem zacząć od stworzenia prostych user flow w postaci graficznej wraz z krótkimi opisami.",
    "RnL-Sketches-p": "Cały design zacząłem od szkicowania. Przelewałem pomysły na papier tak, by tworzony projekt był intuicyjny. Tak by użytkownik mógł w szybki i czytelny sposób operować aplikacją. Inspiracją były programy do odtwarzania muzyki, czy też umożliwiające czytanie tekstu.",
    "RnL-Wireframes": "Wireframes",
    "RnL-Wireframes-p": "Zanim przystąpiłem do tworzenia właściwych wireframes postanowiłem dobrać odpowiednią czcionkę, kolory oraz przygotować elementy (takie jak przyciski, ikony, ramki) umożliwiające sprawniejszą pracę. Po skompletowaniu wszystkiego przystąpiłem do tworzenia bazowych wireframes, nadając im lekki graficzny charakter, obrazujący podstawowe elementy aplikacji",
    "RnL-Wireframes-p1": "User flow jak i wireframes stworzyłem przy pomocy programu Figma. Chciałem by wygląd był przejrzysty i minimalistyczny, tak aby użytkownik szybko znalazł to czego szuka. Miał on przypominać półkę z książkami, dlatego tło jest ciemne z imitacją światła lampy. Głównym założeniem jest znalezienie przez użytkownika książki, która najbardziej mu odpowiada. Może on posortować literaturę przy pomocy panelu kategorii, czy też użyć opcji wyszukiwania, a następnie przeczytać jej opis i dodać do swojej biblioteki. Biblioteka zawiera dwa style: pierwszy oparty na minimaliźmie, nowocześności i szybkim wyborze, natomiast drugi posiada styl klasyczny z możliwością posortowania według kategorii czy nazwy.",
    "RnL-Prototypes-test": "Zapraszam do przetestowania moich prototypów.",
    "RnL-Summary": "Podsumowanie",
    "RnL-Summary-p": "Największym problemem podczas tworzenia takiej aplikacji, byłoby stworzenie tak wielkiej bazy danych posiadających zarówno opcję czytania jak i słuchania. Nie każda książka jest w formie odsłuchu, dlatego też zastosowałem model subskrypcji. Zastanowiłbym się nad opcją przybliżenia tekstu czytanego przez użytkownika, gdyż nie każdy posiada urządzenie z dużym wyświetlaczem. Drugim opcją to możliwość przeskoczenia podczas czytania do wybranej przez użytkownika strony.",

    "Hyjal-p": "Do tego projektu przystąpiłem czysto spontanicznie. Miał on charakter rozrywkowy oraz naukowy. Strona internetowa, którą zamierzałem zaprojektować miała być o  tematyce, którą uwielbiam. Jako zwolennik obcowania z naturą, postanowiłem stworzyć design miejsca campingowego.",
    "Hyjal-p2": "Zamysłem było wykorzystanie w nim popularnej techniki Parallax, którą używa się przy projektowaniu podobnych stron internetowych.",
    "Hyjal-p3": "Jest to strona typu „One Page”, która jest świetnym rozwiązaniem do szybkiej i skutecznej promocji w internecie. Zawiera ona cztery podstawowe sekcje: Home, About, Attractions oraz Kontakt. Każda z nich posiada animacje, które nie są męczące dla oka, a dodają jej nowoczesności.",
    "Hyjal-p4": "Jako, że jest to projekt rozrywkowy zawiera liczne easter eggi z popularnej gry MMO. Wiesz z jakiej?",
    "Hyjal-click": "W celu zobaczenia w pełni jej możliwości, po uruchomieniu prototypu zachęcam do zaznaczenia opcji „Fit to screen” oraz po pełnym załadowaniu do jej zresetowania klawiszem „R” na klawiaturze.",
    "Hyjal-Prototypes-test": "Zapraszam do przetestowania prototypu."


}